{
  "posts": [
    {
      "slug": "week_zero",
      "title": "Two weeks out",
      "blurb": "Welcome to my blog. Sorry the name is corny, my good friend ChatGPT came up with it.",
      "week_post": "Hi everyone! I'll be using this website to update everyone who's interested in my Disney journey. I'll be posting weekly -- at least I plan on it. I'll be posting pictures, eats, pins, and more! So far I know I’ll be working merchandise at Storybook Circus in Magic Kingdom starting in September. As of right now, my program is set to end in January unless I decide to extend it. While I’m dreading the upcoming 16 hour ride in my tiny little car, I’m getting super excited for the four park days I’ll get to spend with my Dad before I start training. I haven’t been to the parks since 2018, so I’m excited to see what all has changed, at least for the most part – RIP Muppetvision 3D. That’s it for now, hopefully I actually get this blog running, because this is my fifth attempt so far.",
      "week_num": "zero",
      "food_reviews": ""
    },
    {
      "slug": "week_one",
      "title": "September 6th through the 14th",
      "blurb": "Made it to Florida! I’ve been busy at the parks, and starting some training!",
      "week_post": "Parks, parks, lectures, and some more parks. My dad and I started our travels on the 6th, and spent the night in Tallahassee where we had our obligatory first night in Florida Cracker Barrel dinner. The next day we got up before the sun, and high tailed it to Hollywood Studios. We were able to get on every single ride at the park. We even rode Smuggler’s Run and Tower of Terror three times each! I was incredibly brave and rode Rockin’ Rollercoaster for the first time ever, and despite how I looked on the ride photo, I really liked it. I moved into my new apartment on the 8th, and got to meet all my lovely roommates. My dad and I got to experience EPCOT’s Food and Wine Festival for the first time on the 9th. Sadly none of the food that we tried was that outstanding, but getting to ride Cosmic Rewind made up for it. That ride is absolutely incredible, and literally had me in awe! Remy’s Ratatoullie Adventure was also great, and smelled fantastic. We hit Magic Kingdom, my new workplace, on the 10th and were a little disappointed with Tron, but mostly just because of the length of the ride. The star of Magic Kingdom was 100 percent the hazelnut spread waffle; absolutely delicious. 10 out of 10 in my book. My dad’s last day in Florida was the 11th, so we took a quick trip to Animal Kingdom. Get this, we rode Flight of Passage with a 20 minute wait! Unheard of for us summertime guests. Obviously we had to get multiple rides on Dinosaur in, and we did. I dropped my dad off at the airport, and headed to Magic Kingdom with two of my roommates and another friend later that day. The 12th through the 14th were much less eventful compared to the rest of the week as I was mostly doing training. That’s all for now, and I’ll check back in next week!",
      "week_num": "one",
      "food_reviews": "I tried a lot of food this week, so don’t expect to see this much ever again as I will no longer have access to my dad’s credit card. The worst thing I ate this week was a Mickey Pretzel in EPCOT. Now I love pretzels but this particular pretzel was lowkey undercooked, and the cheese sauce probably had zero dairy in it. I can get down with some fake cheese, but not this one. By far the best thing I ate this week was the meatloaf at 50s Prime Time Cafe in Hollywood Studios. I know that sounds insane, but that meatloaf was insanely good. I thought I hated meatloaf, but I am now a changed woman. I will be eating meatloaf at “mom’s house” again. No, I did not take any pictures of my food, because I was too busy living in the moment. Honorable mention to the Beignets in Magic Kingdom, they were also pretty good."
    }
  ]
}
